import React from "react";
import {
  Container,
  Row,
  Col,
  CardBody,
  CardFooter,
  Button
} from "shards-react";
import TextField from '@material-ui/core/TextField';
import PropTypes from 'prop-types';
import { withStyles } from '@material-ui/core/styles';
import Card from '@material-ui/core/Card';
import CardContent from '@material-ui/core/CardContent';
import CardHeader from '@material-ui/core/CardHeader';
import Typography from '@material-ui/core/Typography';
import Radio from '@material-ui/core/Radio';
import RadioGroup from '@material-ui/core/RadioGroup';
import FormControl from '@material-ui/core/FormControl';
import FormControlLabel from '@material-ui/core/FormControlLabel';
import Delete from '@material-ui/icons/Delete';
import SpeakerImage from "../components/common/SpeakerImage";
import YouTube from 'react-youtube';
import Box from '@material-ui/core/Box';
import ExpandMoreIcon from '@material-ui/icons/ExpandMore';
import IconButton from '@material-ui/core/IconButton';
import clsx from 'clsx';
import Collapse from '@material-ui/core/Collapse';

const styles = theme => ({
    card: {
      maxWidth: 700,
      margin: 'auto ',
    },

    button:{
      width:"100%",
      marginTop: '28px ',
      marginBottom: '28px ',

    },

    textField: {
      marginLeft: theme.spacing(1),
      marginRight: theme.spacing(1),
      width: "100%",
      margin: "auto",
      textAlign: 'right',
      alignSelf: 'stretch'
    },
    title:
    {
      color: "#38b342",
      fontSize: 40,
      textAlign: 'center',
      alignSelf: 'stretch',
    },
    boxQuestion:{
    },
    boxQuestionCandidate:{
      textDecoration: "underline",
      backgroundColor: "Grey",
      color:"White",
    },
    boxChapter:{
      fontSize:20,
      textAlign: 'center',
      alignSelf: 'stretch',
      textDecoration: 'underline'
    },
    chooseSpeaker:
    {
      textAlign: 'right',
      alignSelf: 'stretch',
      marginRight: "1em",
      marginTop: "1em",
      marginTop: "1em",
    },
    cardContent: {
      margin:"auto",
    },

    speakerChoice: {
      margin:"auto",
    },

    image: {
      marginTop: "5%",
      textAlign:"center"
    },
    expand: {
      transform: 'rotate(0deg)',
      marginLeft: 'auto',
      transition: theme.transitions.create('transform', {
        duration: theme.transitions.duration.shortest,
      }),
    },
    expandOpen: {
      transform: 'rotate(180deg)',
    },
});



function createAnswer(speaker, text) {
  return { speaker, text };
}

function createAnswers(speakers, texts) {
  var answers = [];

  var index =0;

  for (index=0; index< speakers.length; index++)
  {
    answers.push(createAnswer(speakers[index], texts[index]));
  }

  return answers;
}

function createQuestion(q, speakers, texts)
{
  var answers = createAnswers(speakers, texts);
  return {q, answers};
}

const questions =
[
  createQuestion(
    "היעדר זיכרון ארגוני?",
    [
      "costa",
      "ido",
    ],
    [
      "נכון חלקית, כשהתחלתי לנהל את משרד קמפוס התחלתי לבנות את הזיכרון הארגוני מ- 0 , התחלתי לכתוב תיקי חפיפה, לפתוח תיקי פרויקטים שיסכמו הכול, לקיים פא שבועיות, להוציא דוחות שנמצאים בדרייב. איך מתייחסים לזה מבחינה תרבותית? צריך להגיע מלמעלה ולהיעשות באופן אחיד. השאלה פה נוגעת לגבי הנגישות למידע שאנחנו אוספים בין המשרדים ונכון שהוא יוכל להיות משותף בכל הפלטפורמות הדיגיטליות הרבות בין המשרדים שלא צריך לשלם עליהן, כמו שכל רפרנס מתפרסם פה במהירות רבה בין הסטודנטים, אני לא חושב שאם אנחנו נרצה לא נוכל להנגיש את המידע לסטודנטים.",
      "בהחלט מסכים שזו אחת הבעיות המרכזיות ולפני שניגע מה הפתרון בואו נבין מה זה זיכרון ארגוני- זה ידע ששייך לארגון, דבר חשוב מאוד בטח ובטח כשמדברים על אגודה שמורכבת מסטודנטים ובגלל זה צריך לשים על זה דגש. יש המון פתרונות קיימים ויש את שלנו. הדבר הראשון שצריך לציין, שליש מהסטודנטים הם לתארים מתקדמים הם יכולים לספק לנו מענה. הסטודנט עם הפזמ הלימודי הכי מועט הוא עם חמש שנים, חצי עשור, אפשר ללמוד מהם. הקמת מאגר ידע- יש לנו מחלקה טכנית חזקה מאוד, תרבות ארגונית שצריכה להשתנות, פרוטוקולים זה לא"+
      " מספיק, ניהול כמותי ומדוד. הגדרת מטרות לכל משרד, אסטרטגיה משרדית, הגדרת מרכיבי ידע רלוונטיים, הפיכת ידע לבר ביצוע. משרד מסמן לעצמו מטרה והופך את התיאוריה לבר ביצוע בפועל כדי שהסטודנטים יוכלו למדוד אותנו."
    ]
  ),
  createQuestion(
    "שלושה נושאים גדולים שתשאפו לקדם ולשפר?",
    [
      "linoy",
      "ido",
      "mossa",
      "costa",
    ],
    [
      "ראשון הוא יותר אקדמי ואחת מסמכויות היור- התאמות שלא מילואים ועניינים אקדמיים. יש הרבה תחום אפור- אנשים שחווים היריון, הפלות, לידות, אבל, מחלות. כאגודה צריכים לדעת לתמוך. בהינתן תקדימים, אפשר לנסח נוהל, לשאוף לתקנה, לנסות לתת מסגרת ורפרנס לסטודנט.",
      "שני- שירותיות- מטרת אגודת הסטודנטים היא למען הסטודנטים. מייצגת את הסטודנטים, מגנה על הסטודנטים ומשרתת את הסטודנטים. תפקידים באגודה בעלי אופן שירותי. שעות קבלה של נשיאות, מנהלים, רכזים, שיתוף פעולה. שלישי- שקיפות.",
      "באופן כללי חוויה אקדמית שכוללת אקדמיה רווחה ותרבות וחברה. אקדמיה- כלל השירותים להצליח בלימודים, רווחה- כלל השירותים לחיות בנוחות, חברה ותרבות- לגעת בכלל הקהלים שמרכיבים את הטכניון, מבנה ותרבות ארגונית, נגישות, מה נותנים לסטודנטים ואיך, שקיפות, מידע רלוונטי, כביכול השירותים של האגודה, מה אנחנו עושים מאחורי הוילונות.",
      "קירוב הסטודנטים לאגודה, לתת במה של פורום פתוח בכל אחת מהפקולטות לפחות פעם בשנה כדי שאנחנו נכיר את הסטודנטים והם אותנו, אירועי גיבוש בין ועדים למשרדים, משהו כמו  הפי האוור , פיתוח תכניות של חניון עליון, ליישם מסקנות של ועדת העומס.",
    ]
  ),
  createQuestion(
    "תחושה רווחת בקרב ציבור המשתלמים היא שהאגודה שייכת רק לתואר ראשון, מה הבעיה ואיך ניתן לפתור?",
    [
      "costa",
      "mossa",
      "linoy",
    ],
    [
      "התחושה נובעת מכך שכוח ההצגה בועד מנהל וגם בכוח העבודה קטן יחסית לתארים ראשונים, אנחנו בתהליכים שאנחנו לא מכירים את הרצונות של תארים מתקדמים. נכון להיום ההרגשה שלנו שאנחנו לא נוגעים מספיק בתארים מתקדמים היא שאנחנו לא מכירים את הפערים ושהם לא עולים על השולחן כדי לדון בהם, יש לנו את הכלים לתת לקהילה הזאת ולקרב אותם וצריך לתת להם את הבמה בשביל לעשות את זה.",
      " כשנכנסתי לתפקיד בקיץ רוב האוכלוסייה שהייתה פה הייתה של תארים מתקדמים, יו ר תארים מתקדמים לשעבר אמר לי להתחיל את הסאגה של ההקרנות, ההורים רוצים דברים לעשות, הפקנו את אירוע הילדים שהיה בין המוצלחים שהיו, לא באתי להשוויץ. יש לנו את הכלים לעזור.",
      " ליבת האגודה היא אנשים בתואר ראשון ורוב העשייה לא רלוונטית לתואר מתקדם כי הכול שם שונה, כנראה שרוב אוכלוסיית תואר מתקדם לא אוהבת מסיבות. את הצרכים אנחנו יחסית מבינים, מדובר בהורים שלא יבואו למסיבות עד שתיים בלילה. יש אירוע תרבות של תארים מתקדמים, אירוע ילדים, מק מ. הבעיה נעוצה באמון שאנחנו צריכים לעבוד עליו ולדבר עליו בפתיחות, לייצר אחדות והבנה שכשמועצת תארים מתקדמים אומרת משהו אנחנו צריכים להקשיב והדבר הפרקטי יותר זה בעיקר להטמיע ארגונית את השאלה הזאת בכל דבר שאנחנו עושים. אפשר לעשות את זה, צריך לעסוק בזה. לתת את הדעת כבר בשלב אישור התוכניות. ניצול או התממשקות עם יו ר תארים מתקדמים שהוא צלע שלישית לנשיאות."
    ]
  ),
  createQuestion(
    "איך אתם רואים את תפקידה של אס ט במקרים פרטניים של סטודנטים מול הטכניון?",
    [
      "ido",
      "mossa",
      "costa",
    ],
    [
      "אס ט היא חומת מגן, תפקידה המרכזי הוא לטפל, לייצג ולהגן. הגנה זה תפקיד מרכזי. הרכזים הם הקו הראשון של החומה הזאת- מלווה בדין, רכזת תקינות, רכז מעונות, רכז ביטחון, רכז מל ך ושורה של רכזים אקדמיים. למשל עם רכזים אקדמיים, בסוף מגיעים לסיו ר הועדה האקדמית או יו ר הועדה האקדמית והם מדברים עם המרצה בשביל להגיע לעמק השווה. במידה ולא מסתדרים תמיד אפשר לפנות לנשיאות. שאלת אותנו מה התפקיד של אס ט בלהגן על הסטודנטים, זה התפקיד של אס ט- להגן על הסטודנטים.",
      "התפקיד של האגודה זה באמת להגן על הסטודנטים. אם זה מבחינה אקדמית אז יש את הועדה האקדמית שעושה אחלה עבודה. צריך לשמור על אותה רמה, לחפוף טוב מאוד את הרכזים, להמשיך לעבוד על הסאגה. יש את הרל שית של אס ט שמטפלת בדברים האלה. יש את רכז מעונות, רכז רשויות ולזכור שאנחנו פה לטובת הסטודנטים ולתת להם את החוויה האקדמית הכי טובה שהם יכולים לקבל.",
      "התפקיד הראשון של אס ט הוא לייצג ולהגן על הסטודנטים. בעיות מתחילות לצוץ כשיש נושאים מסוימים שהטכניון לא רוצה לקדם ושם צריכים לגלות נחישות והתמדה בקידום התהליכים האלה ולדעת להיכנס גם כשאומרים לך לא. ",
    ]
  ),
  createQuestion(
    "האם בתור נשיאות יש מקום לשיפור הווי באגודה ויחסים בין העובדים?",
    [
      "mossa",
      "costa",
      "linoy",
      "ido",
    ],
    [
      "תמיד יש מקום לשיפור, קודם כל זה מתחיל באישיות של הבן אדם ומאיפה הוא בא. לא משנה כמה התקן גדול הוא תמיד דורש ממך יותר, נתתי מעצמי 200 אחוז כדי להעמיד את המשרד על הרגליים וזה לא יכול לעבוד אם כל הזמן מתקטננים על זה שלא משלמים מספיק. אנחנו פה לתרום לעשייה של האגודה ולתת את השירות הכי טוב לסטודנטים. אני מנסה כדוגמה אישית לשמור על יחסים טובים עם בעלי התפקידים, למנוע את כל העניינים האלה של פוליטיקה פנימית שאין צורך בה, היא לא מועילה לאף אחד רק יוצרת בעיות, מתח באווירה של האגודה וחבל כי אנחנו צריכים להיות מאוגדים, יד אחת, לעזור לחלש, לא להצביע ולהגיד הנה האשם, אנחנו גם צריכים להימנע מהפוליטיקה הפנימית כי זה מוקרן החוצה וזה פוגע בנו כאגודה, זה לא טוב כלפי הסטודנט וזה סתם יוצר אי נעימויות מיותרות ואם נהיה במציאות, אז זה דבר שנטפל בו בדחיפות כי אנחנו לא מתקדמים למקום טוב עם הגישה הזאת.",
      "אני אוסיף ואומר שמנגד לזה, אם אנחנו רואים את עצמנו בתור נשיאות, אנחנו קודם כל צריכים להביא דוגמה אישית ולהכיר את העובדים שבאגודה, לעשות שיחות חתך, לשאול מה שלומם ולתת יד לאלה שנופלים ולא להראות אצבע מאשימה, בסופו של דבר אנחנו מסתמכים בו על הון אנושי סטודנטיאלי שהוא חסר בזמן, הוא עמוס מאוד בלימודים שלו, הוא לא מקצועי אז אנחנו צריכים לפתח את המקצועיות הזאת ולפעול ביחד על מנת לקדם פרויקטים ולא לשים דגש עם מי נכשל.",
      "אני אתחיל באיך ניגשים לעניין ההווי באגודה, קודם כל צריך להבין אנחנו אגודה, עמותה ללא מטרות רווח וצריך להתייחס לעניין שההווי הזה צריכה להיות לו מסגרת מאוד תחומה כי יש פה סטודנטים והכסף של האגודה זה הכסף שלהם וכל הווי צריך להיות בגבול הטעם הטוב ולא נוכל להוציא את ימי הכיף שאינטל מוציאה. לחלוטין יש מקום לשיפור, זאת אומרת ההווי הוא מבחינתי ברור שאנחנו רוצים שיהיה הווי טוב ורוצים את היתרונות שנובעים מהווי שהוא יותר טוב, שזה אומר כוח האדם שיש לך יכולת שלו והרצון שלו להישאר, קשרי העבודה וההתממשקות בתוך הארגון. יש את ההווי היזום שמנהלי המשרדים יתעסקו בלארגן את ההווי, אירועים, ערבי הוקרה, לרוץ ביחד במירוץ הטכניון כאנשי אגודה, לייצר גיבוש שהוא נכון ואמיתי. זה ההווי היזום. אני חושבת שכמו שאמרתי צריכות להיות לו גבולות. ההווי היומיומי זה האדם שאתה יושב איתו בבוקר וזה הקפה וזה האנשים והבוקר טוב, העבודה בפסטיבל הסטודנט זה חתיכת הווי ובזה אנחנו נרצה להתעסק וזה דברים שצריך להנחיל איזושהי תרבות וכבוד הדדי שפועלים בארגון וכהווי כפועל יוצא מהתנהגות שהיא ראויה נכונה ומכבדת הוא כבר יהיה.",
      "חלק מהתפקיד של נשיאות זה גם להדריך ולקשר ולהוות מנהיגות פנים אגודתית בתוך המשרדים ובמידה ומתעוררות חלוקות כאלה ואחרות זה חלק מהתפקיד של הנשיאות לגשר ולדאוג לכך ששאר מנהלי המשרדים והרכזים ידעו וירגישו שבעצם הכיוון הוא אחיד והמטרה היא משותפת.",
    ]
  ),
  createQuestion(
    "האם נעשתה עבודת תחקיר מקדימה למה ניסו בעבר ואיך תוכלו לבצע את המשימות בהצלחה? ואם כן איך תפעלו שונה?",
    [
      "mossa",
      "costa",
      "linoy",
      "ido",
    ],
    [
      "זה לא סוד שעברנו על כלל המצעים שיכולנו להשיג וראינו הרבה מאוד עימותים שמועלים ליוטיוב, אנחנו יודעים שרוב המתמודדים עונים אותו דבר וסביר להניח שגם אנחנו אותו כיוון אבל נראה לי שהעיקר הוא שברגע שנכנסים לכסא הזה, מרוב שיש נושאים לטפל בהם והם יותר דחופים אז שוכחים באמת מה הייתה מטרת העל כי קל מאוד לדבר מבחוץ, אתה לא יודע לאיזה תהליכים אתה חשוף ולא מישהו שיושב בנשיאות, אנחנו יכולים להיכנס לתפקיד ולגלות שתובעים אותנו בסך 20 מיליון שקל ולך תתמודד עם זה ואז הפנטזיות של יאללה בוא נעשה אוטובוסים מעופפים לא ייושם וצריך להיות ריאליים ולזכור שבסוף אנחנו באים לשרת את הסטודנטים ולא משנה איזה קשיים נתמודד איתם אנחנו נדע גם לתת את המידע שאנחנו התחייבנו אליו וזה מסתדר יופי עם הלוז שלנו כי אני לקראת סמסטר 9 יש לי סהכ 3 קורסים אני פנוי, מצידי לישון במשרד כל יום וסמסטר הבא אני אהיה כל יום כל שעה באגודה.",
      "אנחנו ניסינו לתת דוגמאות פרקטיות ולא כלליות שמסבירות איזה באמת צעדים אנחנו ננסה לנקוט ומה בדיוק ננסה לעשות אז אולי כן ב- 2.5 דק ניתן לתת תשובה מאוד כללית מה נעשה בנושא כזה או אחר אבל בסופו של דבר אנחנו עשינו סקר מלא גם על מצעים וגם אני כמישהו שהיה פה 3 שנים באגודה יצא לי לפחות כבר 4 נשיאויות שונות ולהבין מכל אחד מה רוצה לעשות אז יש לי הרבה מאוד דוגמאות של מה עובד טוב ולא ואיך אפשר לעשות את הדברים בצורה אחרת ומתוך זה אנחנו הרכבנו את המצע שלנו ואת הדוגמאות הספציפיות האלה אנחנו ננסה לקדם וליישם בפועל.",
      "קודם כל אני אתחיל ואגיד שמי שלא קרא את המצע אז מאוד ניכר שם שלאמירות שם יש כיסוי ולא התחייבנו על דברים שתלויים בצד ג' אלא בעיקר ב- 90 אחוז ביכולות שאנחנו יודעים ומתחייבים שאנחנו נדע להביא איתנו, יש תהליכים שהם פתוחים יש תהליכים שתלויים בטכניון, בעיריות, בגורמים שהם לא אנחנו ואנחנו נעשה את המקסימום ונביא את הכישרון שלנו בשביל ליישם אותם. אני לא חושבת שיש משהו במצע שאפשר להגיד שמישהו הבטיח בעבר וזה לא קרה כי אנחנו באמת השקענו מחשבה בדברים שאנחנו אומרים ובהבנה שיש כיסוי אליהם. יש לנו את היכולת שכנוע לדבר על זה ולגבי העניין אם נעשה תחקיר אז אני אתן לדוגמה את משרד פרסום- ראינו איך זה פועל בעבר, אנחנו מציעים הצעה שלראייתנו היא תוכל אולי להתממש ולהרים את המשרד הזה. אבל הפוקוס ומה שאנחנו אומרים זה לדבר על פתרונות שהם ברי קיימא ולא להבטיח יותר מידי דברים בלי להבין את הדברים עד הסוף, אז אני חושבת שאנחנו די בסדר עם זה. אנחנו באים ממקום טוב אנחנו רוצים לעשות אנחנו רואים את האגודה ותנו לנו את ההזדמנות.",
      "עשינו תחקיר מעמיק, דיברנו עם נשיאויות ויורים קודמים, קראנו מאמרים על ניהול ואיזה מצעים עברו, אני חושב שזה לא נכון להגיד שכל נשיאות אומרת את אותם דברים ולא עומדת בהתחייבויות אני חושב שכן נעשה מאמץ עצום של כל נשיאות לממש את הדברים שהובטחו. אני חושב שהקושי העיקרי זה כשאתה נכנס לתפקיד כזה עמוס לא להישאב לדברים שהם בשגרה ותמיד לזכור את מטרות העל שהצבת לך ואני מבטיח שאנחנו נדפיס את זה ונתלה. מי שקרא את המצע היה רואה שבסוף המצע שנינו חתמנו עליו כי מבחינתנו זה חוזה עבורכם. אנחנו כאן לטווח הארוך, במידה ותהיו מרוצים נסיים קדנציה ראשונה ונתחיל קדנציה שנייה. וזה כמובן אם תהיו מרוצים כי בסופו של דבר יש הרבה דברים לשנות, אם זה כוח אדם ושיטת ניהול.",
    ]
  ),
  createQuestion(
    "יור האגודה הוא גם חבר בנשיאות התאחדות הסטודנטים הארצית. איזה אג'נדה תרצו לקדם כמי שמייצגים את הסטודנט הטכניוני?",
    [
      "linoy",
      "mossa",
      "costa",
    ],
    [
      "לפני שאני מתייחסת לנושא, ההתאחדות חשובה, אבל הארגון יותר. קודם כל נעשה לביתנו ואחר כך החוצה. קודם כל להוציא את הפוליטיקה מההתאחדות ולא את ההתאחדות מהפוליטיקה. פוליטיקה כמו שיוך למפלגות וכדומה. צריך לדעת מה שמסריח, מסריח. ההתאחדות היום דואגת בעיקר לאגודות קטנות עם פחות אמצעים. אנחנו לא נשענים על ההתאחדות."+
      "עוד דוגמא: כשהייתי רכזת מילואים קיבלנו זימון בזמנו עם עומר עמית ועודד אומן לביקור בכנסת. התכנסה ועדה שדנה בעומס וביכולת של מוסדות אקדמיים להכיל את משרתי המילואים. אגודת הסטודנטים שלנו מצטיינת בעניין הזה ושמה הולך לפניה. נוצר שיח מאוד בריא בין אגודות סטודנטים. הבאנו זרקור בעניין המילואים."+
      "שוב אני אומרת, זאת עדיפות שנייה ולא משהו שאני רואה לנכון להשקיע כנשיאות אגודה.",
      "התאחדות הסטודנטים היא גוף שמונע מאינטרסים פוליטיים, מה שאני שונא באופן כללי זה פוליטיקה, אני לא נכנס לעניינים האלה, זה לא מעניין אותי. כל מה שיכול לפגוע בסטודנטים באופן ישיר או עקיף, אנחנו נימנע מזה. אנחנו נתקע להם מקלות בגלגלים אם צריך, אנחנו לא נתמוך בשום דבר שקשור לפוליטיקה או לפגיעה בסטודנטים שלנו, שיהיה ברור. בקשר לקידום סוגיות שנויות במחלוקת: יש את הועד המנהל של אסט שנוכל להתייעץ איתו. לא מספיק שבן אדם אחד יחליט בשם כל הסטודנטים, לפחות שיהיה גיוון ברעיונות, שנשים את הקלפים על השולחן ונהיה גוף אחד ולא בן אדם אחד שמחליט על כולם. יש לזכור ששיתופי פעולה זה חשוב. אסט כיום עומדת כגוף מייצג בצפון, אנחנו צריכים לשמר את הקשר בין האגודות בצפון ולהיות מרכז הכובד אפשר להגיד. אפשר לעשות הרבה דברים שיש לנו כוח לא רק של אגודה אחת וכולנו נצא לאותו מסע שזה לטובת הסטודנטים ללא מניעים פוליטיים כלשהם.",
      "כפי שידוע אנחנו נמצאים כבר די זמן בתפקיד ניהולי ומתוך כך יצא לנו לבקר בכמה התכנסויות של התאחדות הסטודנטים ולשמוע את דעתם הכללית לגבי המשימות שנדרשות לעשות בזמן הקרוב בשביל הסטודנטים. הם לא באמת מנסים להפעיל איזשהם יכולות מקצועיות לקידום המשימות האלה, אלא יותר באמת לחץ חברתי באמת והרעש סביב הנושאים האלה. אנחנו מנגד זה פועלים כגוף מקצועי לקידום המשימות הסטודנטיאליות, אבל אנחנו לא נדרשים לפנות לאותם המוסדות בצפון רק דרך התאחדות הסטודנטים. אנחנו יכולים לפנות ישירות לאותם היורים, לאותם האגודות ולפתח שיתוף פעולה בכל ההיבטים האפשריים. למשל יצא לי לדבר עם יו ר של שנקר וויצו והם רצו שיתוף פעולה בין היכולות גרפיקה שלנו ושל פרסום.",
    ]
  ),
  createQuestion(
    "כידוע באגודה כמו בכל סביבת עבודה נוצרים קשיים והתנגשויות במהלך קידום תהליכים שונים. איפה אתם חושבים שיהיה לכם קושי בקידום התהליכים וכיצד תתמודדו איתם? גם כצמד וגם בנפרד.",
    [
      "costa",
      "mossa",
      "linoy",
      "ido",
    ],
    [
      "אם להסתכל על השאלה הזאת אפשר להבין אותה שהיא כביכול שואלת אותך איך לנהל משא ומתן מול גורמים בטכניון בסופו של דבר. כדי ליצור אינטרסים משותפים לטכניון לקידום של תהליכים מסוימים אתה צריך פשוט לדעת איך אתה בונה את ההצגה שלך בצורה כזאתי שתהיה אטרקטיבית גם למען הטכניון לקידום של אותו נושא, במיוחד אם הוא כולל בתוכו את האספקטים הכלכליים. נכון להיום הצלחנו להביא כמה נושאים כאלה לקידום ללא שום השתתפות כלכלית של אסט מצידה. למשל, כל הנושא של הנסיעות חינם, הבניה של החניון אוטובוסים בקמפוס ללימודי חוץ, הרחבת תשתיות של תחבורה ציבורית. הם רצו לעשות את זה, אבל הטכניון לא תמיד יודע להסתכל מלמעלה ולהגיד איך לעשות את זה, אז פה אנחנו נדרשים לשתף פעולה ולהציג את הדברים האלה בצורה באמת אסרטיבית ומחושבת. לא רק לדעת להגיד  תן לי  אלא למה זה טוב לתת, כי זה ישרת את האינטרסים של שנינו.",
      "טוב אז אני אזכיר עוד פעם שאני התחלתי כרכז רשויות אצל קוסטה, עבדנו ביחד כ-11 חודשים. אנחנו יודעים לעבוד ביחד, בנפרד, יודעים לתמוך אחד בשני, יודעים את החולשות והחוזקות של השני, יודעים לתת, יודעים לקבל. ספציפית בנפרד, כל אחד מקצועי בתחום שלו. הוא במשא ומתן מול ספקים, בחוזים, עניינים משפטיים. אני יותר בוא נגיד  give and take  כי בעבודה שלי כרכז רשויות עבדתי מול רשויות כגון ביטוח לאומי, ארנונה, שאתה צריך למשוך אותם לפה כביכול שהם באים בהתנדבות. עניין אטרקטיבי שהם ירצו לבוא ובשמחה גם, וזה מה שקורה היום. מבחינת משטרה, כל העניין הזה של הרישוי מסיבות, שאנחנו צריכים להיות מקצועיים איתם, כי אם נפשל פעם אחת אז אנחנו שרופים בעיניהם והם יפסיקו להתייחס אלינו ברצינות ואנחנו לא רוצים להיות שם בגלל פסטיבל הסטודנט שהוא דורש הרבה התעסקות עם המשטרה וגם כן עם הביטחון של הטכניון שכרגע אנחנו עומדים במערכת יחסים טובים ונמשיך להיות ונקדם אותה למקום טוב יותר.",
      "אוקיי אני אתייחס לקשיים בפנים אגודה, בספירה שאנחנו עובדים בה ואם יהיה זמן נתייחס גם לקשיים מול הטכניון. אני אגיד קודם כל מה הגישה שלי לגביי קשיים, זאת אומרת, בכל תפקיד ניהולי, בכל אופרציה שהיא מורכבת ולא אלמנטרית יש קושי ואני חושב שהדבר הראשון אנחנו צריכים לדעת לקבל את הקושי, זאת אומרת זה יגיע, אנחנו אף פעם לא נעבוד לפי תכנון אז לא להתפלא ולא להיכנס לאיזושהי פאניקה. אני חושבת שאנחנו צריכים לנסות להפריד את שני הקשיים, או שלושת הקשיים: יש את הקושי בתוך הארגון פה שהוא מול הועד המנהל, מול מועצת הנציגים, מול אפקט, מול אס א, שזה קושי מול סמכויות שאנחנו לא המנהלים שלהם. זאת אומרת אנחנו נצטרך למצוא איזשהן דרכים יותר לא אלטרנטיביות אבל כישרון שהוא לא בהכרח להגיד  תעשה כי אני המנהל  אלא לדעת לנצח על הדבר הזה ולא להיות זה שקובע. לדעתי בעיקר סוגיית הועד המנהל זה לדעת לנהל את הדיון. זאת אומרת אי אפשר לבוא בטענות על איזשהן אי הסכמות בין אנשים בוועד מנהל, כי זה התפקיד שלהם, לשם כך הם נבחרו. אז אני חושבת שאנחנו צריכים קודם כל לדעת לתת את הקושי בדיון שיש לו מסגרת שהיא עניינית, לגנות פינות שהן אישיות ולא מתאימות לדיון ולהוות דוגמא אישית בעניין הזה, זאת אומרת לא לקחת חלק בניהול שהוא של דיון לא נכון ולא רלוונטי.",
      "אז אני אגע בקידום תהליכים שהם פנים אגודתיים, שזה בעיקר בקרב מנהלי משרדים ורכזים. אנחנו נוקטים בגישה ניהולית שהיא מאוד פתוחה וקשובה, שכל אחד יכול להביע את דעתו ועמדתו בכל נושא ובכל עניין, זה דבר ראשון. ועם זאת, אנחנו יש לנו כמה וכמה כיוונים שאנחנו רוצים לקדם ולשנות אם זה שינוי התרבות הארגונית או פרויקטים ויוזמות כאלה ואחרות ואנחנו נעשה את השינויים האלה תוך שכנוע של הרכזים השונים ושל מנהלי המשרד השונים ותמיד באף ארגון אי אפשר לשכנע את כולם. במידה ויהיו אנשים שלא יהיו משוכנעים, ויהיו כאלה, אנחנו נעשה כל מה שאנחנו יכולים לעשות כדי לעזור להם להתגבר על הקשיים האלה ולעבור את השינוי בהצלחה ובבטחה. בסופו של היום משפט אחרון: בסופו של יום הנשיאות מקבלת את המנדט שלה לנהל את האגודה מהסטודנטים וכך היא תעשה.",
    ]
  )
]

const audience_questions=
[
  createQuestion(
    "האם אתם רואים את האגודה כא-פוליטית או כא-מפלגתית ואיך אתם מתכוונים לשמור על האגודה מנוטרלת מאינטרסים פוליטיים?",
    [
      "linoy",
      "ido",
      "costa",
      "mossa",
    ],
    [
      "אוקיי אני חושבת שהתשובה היא כתובה בתקנון. אנחנו רואים את האגודה כא-פוליטית. בהתייחס לאיך אנחנו תופסים ואיך אפשר לאכוף את זה, אני חושבת שקודם כל פשוט מה שנראה ככה, מדבר ככה הוא כנראה כזה, ולדעת מתי אנחנו חוסמים ולא נותנים יד לדברים שהם יש להם אוריינטציה שהיא פוליטית, וזה בעיקר לשמר את מה שקרה פה עד עכשיו. אני חושבת שאס ט נמצאת במקום טוב בעניין הזה. אנחנו לא חווים יותר מדי מקרים שיש בהם משהו מפלגתי, פוליטי ובעיקר אני חושבת להיות ענייניים ולהתעסק במה שאנחנו עושים עכשיו, זאת אומרת, אין פה אף משרד באגודה שאמור להיות לו איזשהו עניין פוליטי, אז לשמר את העניין הזה ולנסות כן לתת קשב, כי החיים הם לא סטריליים, זאת אומרת אפשר להגיד אנחנו לא פוליטיים ואז יש לך איזשהו מקרה קצה ויש פה אוכלוסיות מגוונות, אז כן לתת את הקשב ולדעת לשים את הגבול שהוא ברור, זאת אומרת לא להיכנס למצב שהוא יכול להתפרש כסתימת פיות או כמשהו שהוא השתקת ציבור, אבל לדעת גם לשים את הגבול ולהגיד כאן זה כבר נהיה פוליטי ולכן זה לא המקום ולא הבמה.",
      "אז כמו שלינוי אמרה, האמירה היא חד משמעית. זה לא מתפרש לשני פנים, אס ט היא א-פוליטית, וזה חלק מהיופי שלה וזה חלק מהסיבה שנותנת לה להתנהל בצורה כזאת. כמו כן, יש מנגנונים רבים שאמורים לוודא ודואגים לכך שהיא תישאר כזאת, בין אם זאת ועדת ביקורת ובין אם זה חברי הועד המנהל. כמובן שגם הנשיאות והסטודנטים עצמם. איך אנחנו מתכוונים ליישם את זה? זה בסוף, א' כל, common sense , זה פשוט קל לראות את זה, יש הגדרות לדברים האלה. דבר שני, זה קשיבות ופתיחות. אם יש ספק, אין ספק. אם לכל דבר יש ספק שהוא אירוע פוליטי הוא לא יתקיים.",
      "אז קודם כל אנחנו רואים לנכון לשמר את הגישה הפוליטית. אנחנו לא מעוניינים לקחת חלק כמו שאר האגודות בנושאים האלה. כמו כן אנחנו רואים שחשוב באמת לבדוק את הגופים שמגיעים לפה מבחוץ להרצות ולתת כל מיני תכנים שלא יהיו קשורים לתכנים פוליטיים, ואם כן קשורים אז להחתים אותם על טופס התחייבות שכמו חוזה מצידנו, שאם הם יפרו בנושא כזה ואחר ויכנסו לפן הזה אז הם יקבלו קנס כדי לחסום את האפשרות שזה בכלל יתקיים. אנחנו צריכים להבין, שנכון שאמנם הוצאנו את הפוליטיקה החיצונית החוצה מאס ט, אבל נכון להיום קיימות גם פוליטיקות פנימיות וזה אנחנו גם רוצים להימנע מהנושא הזה ולהוציא את זה החוצה. אנחנו רוצים שבתוך האגודה יהיה באמת וייב טוב וקופרטיבי בין המשרדים והרכזים ורגש של משפחה. אנחנו לא רואים לנכון בכלל להכניס את הנושאים הפוליטיים לאגודה. אין להם רלוונטיות במוסד האקדמי שהגענו אליו כדי לקבל תואר ומי שמגיע לאס ט- גם כדי לתרום ולעשות משהו מעבר. אין לזה במה מבחינתנו ולא צריכה להיות גם.",
      "אני אדבר אישית על עצמי, כבר הזכרתי את זה, אבל הסיבה העיקרית שבכלל נכנסתי לאגודה היא בגלל שהיא א-פוליטית, א-מפלגתית ולא מצדדת אף צד בשום הקשר, בין אם זה דת בין אם זה קהילה מסויימת או כל דבר אחר שהוא כביכול מפולג. אנחנו באמת רוצים לשמר את זה כי זה מה שגורם לתחושה של אחדות, כיף, כיף להיות פה. אנחנו צריכים לעשות את זה נוח, אווירה, כמו שאמר קוסטה, אווירה של משפחה, כי בסופו של דבר אנחנו סטודנטים ואנחנו לא באמת בנויים לעומס יותר מאשר הלימודים, אנחנו גם ככה לחוצים, אנחנו צריכים לבוא הביתה ולהרגיש בנוח, שיהיו לנו חברים פה ולהימנע מכל דבר שמיותר בעינינו שזה פוליטיקה בעיקר."
    ]
  ),
  createQuestion(
    "איך תוכלו לקדם את נושא המחזור בקמפוס?",
    [
      "costa",
      "mossa",
      "ido",
      "linoy",
    ],
    [
      "אז קודם כל אני רוצה להגיד שאנחנו כן הצלחנו לקדם את נושא המחזור בקמפוס, לפחות בחלק מאיזורי המעונות ביחד עם שדרוג ותקציבים נוספים שהוקצו לתחזוקה. נושא המחזור צריך לעבור איזשהו ריענון ואורגניזציה מחדש. צריך להבין שהנושא הזה צריך להיות קודם כל מטופל על ידי הפקולטות ואז ידי אזורי מעונות בעצמם. אצל הסטודנטים מקסימום מה שאנחנו יכולים לפתח זה את התרבות המחזורית. אבל אין לאס ט את הכוח הלוגיסטי והאופרטיבי באמת לבצע מחזור אחרי 15,000 סטודנטים שנמצאים בקמפוס. אנחנו יכולים לעשות את זה אבל אנחנו נצטרך לחתוך בהרבה מאוד דברים אחרים. אז כדי לבצע וכדי להעלות את הנושא הזה על המודעות אנחנו צריכים לקדם את זה בכל שאר האיזורים כמו שכבר התחלנו במעונות ולהכניס את זה גם לפקולטות. אנחנו צריכים להעמיד את הדרישה הזאתי בדיונים בטכניון ולגרום לביצוע. זה לא משהו שהוא לא בר ביצוע. הרבה מאוד אגודות אחרות עושות את זה ונשענות על התמיכה של המוסדות ומישהו כמו הטכניון צריך לא לעמוד מאחורה ולתת רוח גבית. העשייה הזאת היא שומרת בסופו של דבר את המקום שאנחנו חיים בו לדורות הבאים.",
      " כמו שקוסטה אמר אנחנו לא באמת כאגודה יכולים להרים מערך גדול שכזה. אנחנו צריכים את עזרת הטכניון. אנחנו צריכים לגרום להם לרצות את זה, וזה התפקיד שלנו כנשיאות לדאוג שדבר כזה מתקדם. אנחנו צריכים ללכת לשם ולהראות להם מה קורה עכשיו ואיפה אנחנו רוצים שזה יתקדם וזה התפקיד שלנו בעצם, לקדם תהליכים מול הגופים הבכירים כדי להגיע למקום טוב יותר ואני בטוח שהטכניון גם מעוניין בקידום שכזה וזה win win situation אם אתם שואלים אותי.",
      "אז כמו שנאמר באמת יש באגודה רכז שזה כל עולמו, כל תפקידו שנקרא רכז קיימות. הוא מתעסק בכל נושא המחזור וכל הנושא של כל מה שירוק וכל מה שבעצם מקדם אנרגיה מתחדשת. אני חושב שאנחנו כנשיאות זה משהו שהוא כן על סדר היום. אנחנו נהיה פתוחים לשמוע מסטודנטים על כל תכנית, על כל יוזמה ונדחוף אותן. בין אם זה שיתוף פעולה עם הטכניון ובין אם זה יוזמה שלנו או קישור לגורמים הרלוונטיים. אני חושב שצריכים להיות עוד פרויקטים כאלה שהם  ירוקים  מה שנקרא. אם זה מהמזגן בפקולטה של מדעי המחשב שהמים שהם מזרימים בסוף זורמים במפלים שנמצאים אצלנו בקמפוס. יש לנו גם רעיונות ליוזמות, בין אם זה תחבורה בטכניון, אם זה מיניבוסים חשמליים. אבל באמת התוכניות האלה זה כותרות ושלבי רעיון. אין לנו ספק שתהיה יוזמה כזאת, שתהיה דרישה כזאת. אנחנו ניתן את המענה לזה. ",
      "אני רוצה להתייחס לעוד משהו, דיברנו על הקשר עם הטכניון. קודם כל, משהו שכבר רץ במשרד חברה וקהילה זה שיתוף הפעולה עם מרכז הקיימות. מרכז הקיימות מכיל סטודנטים שמתעניינים בכל עולם התוכן הירוק, הסביבתי, אז לחזק את שיתוף הפעולה הזה. הדבר הבא זה לדעתי, מבחינת ועדים, זה קורה היום, להמשיך את העניין הזה, לייצר איזושהי אולי מערכת תגמולים לועדים ממחזרים. זאת אומרת, בסוף, עיקר התנועה של הפלסטיק קורה בפקולטות, איפה שיש מכונות, איפה שיש קפיטריות, אז לתת איזושהי מוטיבציה להתעסק בזה פרט לעניין הסביבתי כי זה מה שצריך. אני חושבת, משהו אחרון, מי מכם שמכיר, הרבה מהעניין הסביבתי הוא פלסטיק, קשים וכוסות במסיבות. אם נסתכל על כל הבקבוקים שיש בקמפוס, אנחנו מכילים כמות של פלסטיק במסיבה אחת. אני לא אומרת עכשיו שאני אביא כוסות מדפי תירס כי צריך לבחון ולראות הצעות מחיר, אבל לנסות לייצר משהו שהוא סביבתי. קורה במסיבות שהנדסת סביבה מביאים כוסות מהבית.",
    ]
  ),
  createQuestion(
    "מה שני הדברים שבעיניכם עבדו פחות טוב באגודה בזמן האחרון שהייתם באגודה ורוצים לשפר?",
    [
      "ido",
      "linoy",
      "ido",
      "costa",
      "dan",
      "costa",
      "mossa",
    ],
    [
      "אני חושב שהדבר הראשון שקופץ לי לראש מהשאלה שלך זה הממשקים הבין משרדיים. אני חושב שכיום, א' כל אין תחושה כזאת שמנהל משרד, אם מגיע סטודנט או נציג סמסטר או יו ר, אין תחושה כזאת של קבלה של  בוא ונשמע ואנחנו עבורך  מהפן השירותי, זה א' כל. הנושא השני של ממשקים בין משרדים, זה ממש הממשקים בינם לבין עצמם. אני חושב שפגישות שבועיות בין מנהלי המשרדים עם הנשיאות, זה משהו שהוא חייב לקרות על בסיס שבועי. בנוסף, חייבת להיות פגישה של גורמי הנשיאות עם כל אחד ממנהלי המשרדים כדי לראות שאנחנו באמת מתקדמים ולא עובדים במקום. כמו שנגענו גם בשאלות הקודמות, אחד התפקידים של הנשיאות זה גם לגשר ולדאוג שתהיה הרמוניה, שתהיה התנהלות רציפה ובאמת שההתנהלות והתפוקה עבור הסטודנטים תהיה כמה שיותר גבוהה.",
      "אני אגע בעוד נושא שהוא יותר לא פנים, יותר חוץ, זה העניין של השקיפות והשירות. מי שנמצא בקבוצות הפייסבוק יודע שתדמית האגודה לא בשמיים היום ואני חושבת שיש לזה סיבה. אי אפשר להגיד שזה סתם כי היו תקופות עם אמון גבוה יותר של הסטודנטים בנו. אני חושבת שזה שקיפות ושירות ביחד. שקיפות זה פשוט היכולת שלנו להראות החוצה   הנה, זה מה שאנחנו עושים  וכשאתה מראה אז יותר קשה לבוא אליך בטענות וצריך להיות יותר ענייניים ולהגיד  אס ט האלה . הדבר הבא זה שירות. אנחנו חווינו פה כמה מקרים של תאקלים בין רכזים לבין סטודנטים ובסוף סטודנט אחד כזה שיוצא מספיק נפיץ החוצה לחברים שלו פוגע בתדמית של האגודה. אז שקיפות ושירות אלה הסיבות, אבל בסוף מדובר בתדמית ואני חושבת שאם מתעסקים בזה ואם אנחנו נדע לאמוד את עצמנו בהיבט של השקיפות ונדע כל הזמן לבקר את עצמנו מבחינת איזה שירות אנחנו נותנים, אנחנו נדע גם להרים את התדמית שלנו.",
      "יש אימרה שאומרת  הלקוח תמיד צודק , האימרה הזאת לא נכונה. אנחנו לא דוגלים בזה. אנחנו דוגלים בזה שהלקוח אולי לא תמיד צודק. אבל הוא תמיד הלקוח! והסטודנט הוא הלקוח ואנחנו צריכים לגרום לו להרגיש ככה.",
      "תחזור רק על השאלה.",
      "מה שני הדברים שבעיניכם עבדו פחות טוב באגודה בזמן האחרון שהייתם ואתם רוצים לשפר.",
      "אז קודם כל הנושא הראשון הוא הכי קריטי בעינינו זה ההון האנושי ויכולת הגיוס של האגודה לשורותיה לביצוע משימות. במכרזים האחרונים הייתה נוכחות מאוד דלה אם בכלל הייתה של אנשים שרוצים להגיע ולקחת חלק באגודה וכל זה כחלק מהסיבות גם מה שלינוי ועידו אמרו. שהאגודה נהייתה למקום לא אטרקטיבי בעיני סטודנטים. הם לא מרגישים קשורים אליה, הם לא מבינים מה אנשים עושים פה. ואם הם מגיעים לפה אז הם מקבלים הרגשה של מכריחים אותם לעבוד והם חייבים כי הם מקבלים 10 שקל בחודש. ואנחנו לא דוגלים בשיטה הזאתי ואנחנו לא חושבים שזה נכון. וכדי שהסטודנטים יראו וירגישו אחרת אנחנו צריכים לעשות את זה בראש ובראשונה מתוך הרגל והמקום של הנשיאות. לתת דוגמה אישית, להגיע לאינטראקציות בין הועדים לסטודנטים ולהראות כלפי חוץ על ידי. אפשר לתת 1000 דוגמאות. על ידי סרטוני וידאו, על ידי מסיבות, על ידי כל מיני HAPPY HOURS  של חלוקת בירה פיצה לא משנה מה, צריך להראות שבמקום הזה, חוץ מלהעמיס בעבודה יכול לתת לך את המעטפת המשפחתית, יכול לתת לך את ההרגשה של כיף וכשאתה תגיע לפה, התרומה שאתה תתן היא תהיה משתלמת. אתה תרגיש הערכה לעבודה שלך.אתה תרגיש שאתה עושה משהו באמת ששווה בשביל הסטודנטים ולא סך הכל כמו עוד סוללה שבאים לשאוב ממנה את המיץ ואז לזרוק אותה ולהחליף בחדשה.",
      "וברגע שיש לך ההון האנושי צריך לשמר את הקשר בין כלל המשרדים. כי ברגע שיש לך תקשורת טובה אז העבודה זורמת יותר כמו שהזכרתי קודם וזה מתבטא החוצה, כי אם הקשר בין עצמנו לא טוב, הסטודנט ירגיש אוקיי לא נעים לי להיות פה הוא עושה סיבוב פרסה והולך. והרכזים גם מדברים שהם יוצאים מפה, הם מועמסים הם לא לא כיף להם הם מרגישים אוירה לא נעימה וכשהם יוצאים. ושואלים אותם מה החויה שלך מהאגודה הם אומרים שלא כיף ויצאתי בריצה כי מעמיסים עליי ואין את האוירה הכיפית שדמיינתי שתהיה. וזה בעצם פה מניעים את התהליכים. אם כיף לך ואם נוח לך ואתה מחכה בקוצר רוח שתסיים לימודים ותבוא לאגודה אז פה ניצחנו.",
    ]
  ),
  createQuestion(
    "חוסר ידע בנקודות ספציפיות באגודה איך תתגברו על זה ותנהלו תהליכים באזורים אל במיוחד כשרוב מנהלי המשרדים מתחלפים?",
    [
      "mossa",
      "costa",
      "linoy",
      "ido",
    ],
    [
      "טוב אז ככה, את הדבר הזה כבר עברתי. הייתי רכז רשויות במשרד קמפוס ועברתי להיות מיד אחרי זה מנהל במשרד תרבות. זה שני נושאים שלא קשורים אחד לשני והתגברתי מאוד על הפער ידע שיש לי וכמעט חודש וזה היה תוך כדי תקופת מבחנים. ואני חושב שהמשרד היום עומד במקום טוב מאוד ואנחנו נמשיך לדאוג שהכל יתקדם. יש לנו לשנינו יכולת למידה מהירה מאוד. אנחנו נכנסים ישר לעניינים אנחנו קופצים למים עמוקים, לא חוסכים במעשים. אנחנו נשקיע את כל הזמן שיש לנו, כמה שנדרש לא באמת מעניין אותנו אם זה קשה לא קשה אנחנו נעשה הכל ולא נוותר עד שיהיה לנו את השליטה המלאה ויש לנו גם מנהלי משרדים שהם יוצאים, הם יכולים לייעץ לנו ,שום דבר לא הולך לאיבוד. יש לנו את העזרה שאנחנו יכולים לקבל מכל בן אדם ויש לנו מספיק ניסיון לעשות את זה ונעשה את זה עוד פעם ועוד פעם ועוד פעם.",
      "אז חוץ מזה קיימים מקורות ידע רבים, גם של יורים קודמים וגם של אפילו עד לתקופות של דני מגנר שדיברנו איתו שישמח לבוא ולתת ולספר לנו את המידע שחסר. גם אני גם הוא הגענו למשרדים שלא נשמר שום זיכרון ארגוני ולא היה ברור איזה תהליכים עומדים על הפרק ומה בכלל אנחנו צריכים לעשות. השלמת ידע זה לא מקור הבעיה זה מה אתה עושה אחרי זה עם הידע שאתה צובר. אם אתה יודע להשתמש בו נכון או לא. וקידום של תהליכים מול הטכניון לא שונה בנושאים תקציביים בסופו של דבר אם מדובר בהשקעה של מיליון וחצי לנושא מסוים או בקידום של יוזמה אקדמית.בסופו של דבר הטכניון כגוף רואה בכל זה כתחשיב כלכלי, האם כדאי לעשות לו את זה והאם הוא יכול לעשות את זה. והגורמים שמקבלים את ההחלטות הלאה לרוב זה אותם הגורמים ולנו כבר יש את הקשר האישי איתם ואנחנו יודעים איך לדבר איתם ואנחנו יודעים מה מניע אותם ואיך אפשר לפחות לנסות חלק מלמשל מסקנות ועדות העומס לבוא וליישם אותם בפועל וכן אנחנו השקענו הרבה זמן כדי לקרוא ולהשלים את הידע שהיה חסר לנו של ועדה אקדמית.",
      "אני אגע קודם כל , מניחה שהטענה המרכזית היא שאנחנו אולי פחות, יותר אקדמיים ופחות כל השאר. אז קודם כל חשוב לי להגיד שקודם כל במסגרת השיח שלנו העניין הוא ניהול. ונגענו בעניין ובניסיון הרלוונטי שיש לשנינו ואני רוצה רגע לגעת לגביי מבחינת הניסיון וההיכרות שלי עם כל המשרדים אז רק להגיד, אני פרט ללהיות בועדה אקדמית ובועד ותארים מתקדמים במהלך הניהול של המקמ התממשקתי חוץ ממשרד תומך למידה עם כל שאר המשרדים אז ההיכרות היא ישנה זאת אומרת היא ישנה מעבודה משותפת והיא ישנה מהצורך ומההבנה של הנחיצות של המשרדים האלה בתוך האגודה ואני רוצה לדבר רגע יש אנחנו צריכים לחלק קצת את העבודה בנשיאות ובאגודה בכלל. לאקדמי ומנהלתי. האקדמי זה בעיקר שיח צריך לבוא ולדעת ולדבר ולהיות מדויקים עם הצעות פרקטיות כדי שנוכל להיות בכלל כשירים לשיחה אל מול הטכניון. ויש את הענייין המנהלתי, להיות מנהלתי זה לדעת לנהל אופרציה פיזית לדעת להרים דברים לדעת לדבר עם ספקים. אז פה אני באמת אומרת, מי שלא יודע הניסיון שלי הוא לא רק באקדמיה או בלהיות בתוך ועד. הניסיון הלוגיסטי שלי הוא ישנו. אני יותר מזה מוסמכת מקצועית להיות בן אדם שעוסק בלוגיסטיקה אז חשוב לי להגיד שאין מה לדאוג מהבחינה הזאתי.",
      "אני אגע בשני דברים, שני חלקי השאלה. נושא ראשון זה שלב הלמידה והיעדר הידע. אני חושב שאנחנו מגיעים, התפקידים שעברנו הם רחבים ומגוונים ובכל תפקיד שהגענו אליו הראנו שאנחנו יודעים להיכנס לתפקיד בצורה מהירה ללמוד את הדברים לעומק ובצורה יסודית ובסופו של דבר גם ליישם אותם בשטח. אני אוסיף ואומר שגם יש לי תחושת דה ז'וו כי הדבר הזה נשאל גם לגבי גם במכרז לתפקיד סיור הועדה האקדמית. אני חצי שנה בתפקיד ואני לא מרגיש שיש שאלה שיכולים לשאול אותי ואני לא אדע להגיד במדויק וגם אם כן אני אדע תוך 2-3 דקות לפתוח תקנון ולתת תשובה מדויקת. זה לגבי זה. הנושא השני הוא כוח אדם באגודה,זה משהו שהוא לא חדש. כל שנה יש מכרזים מחדש, לכל תפקידים באגודה אנחנו נגייס נבחרת אני לא דואג לגבי זה, אנחנו בסוף אגודה עם מקום בעל המון משמעות להגן על הסטודנטים להיות שם בשבילם. וזה מה שיעזור לנו בתהליך הגיוס.",
    ]
  ),
  createQuestion(
    "שאלה ללינוי ועידו: עידו היית הרבה זמן באגודה ולא היית מנהל משרד האם זה לא קפיצה למים העמוקים?",
    [
      "ido"
    ],
    [
      "אז אני חושב שניהול זה לא מתת אל זה לא משהו שנולדים איתו, ניהול זה משהו שלומדים כמו כל אחד מהתארים שפה גם ניהול זה משהו שאפשר להשתפר בו. מבחינת שנות ניהול יש לי למעלה מ7 שנות ניהול בין אם זה בצבא בתפקידי פיקוד על בתור מפקד כיתה בתור מפקד מחלקה בתור מפקץ ובתור סגן ראש מדור זה לגבי ניהול בצבא. לגבי ניהול אחרי הצבא, ניהלתי, אני מנהל עד היום מסגרת שמונה 30 חונכים אקדמיים ונותנת מענה כמו שאמרתי ל500 סטודנטים ברחבי הטכניון. זה לגבי זה. תפקיד אחרון עכשיו בתור סיור ועדה אקדמית אני חושב שזה תפקיד שהוא שקול למנהל משרד. בסופו של יום אני מתעסק עם 18 רכזים אקדמיים עובד מול גורמי טכניון מרצים כאלה ואחרים. אני חושב שמהבחינה הזאת אין בעיה.",
    ]
  ),
  createQuestion(
    "לינוי לא היית הרבה זמן אבל גם לא עברת תפקיד ניהולי האם זה לא קפיצה למים העמוקים?",
    [
      "linoy",
    ],
    [
      " קודם כל למי ששאל את זה אני שנה רביעית באגודה, אז אם זה לא מספיק זמן אז אני לא יודעת מה כן מספיק. ומבחינת הניסיון הניהולי כבר ציינתי אותו. מי שלא יודע התפקיד במקמ הוא תפקיד ניהולי לנהל 17 אנשים שמדריכים פלוס 5-6 עובדים שהם סטודנטים שעובדים באופן קבוע. זה תפקיד שהוא ניהולי וגם לנהל ועד זה תפקיד שהוא ניהולי וגם להיות מפקדת של 40 חיילים במילואים שגדולים ממני ב10 שנים זה גם ניהולי . אז אם יש למי שאלות יותר ספציפיות על הניסיון הניהולי והיכולת הניהוליות אני אשמח לענות"+
      "עידו: אני רק אוסיף שתפסתי את עצמי אומר זה לא בעיה, זו כן בעיה. האתגר הוא אתגר גדול. אין ספק שזו קפיצת מדרגה זה לא איזשהי משהו שאנחנו לא יכולים לעמוד כי אם היינו חושבים שאנחנו לא יכולים לעמוד בו לא היינו מדברים על זה ולא היינו מגישים מועדמות. בסופו של יום אנחנו מרגישים מאוד בשלים ואנחנו מאמינים שנצלול לתפקיד נעשה הכל ונלמד את הדברים בצורה יסודית על מנת להפוך את האגודה לצורה כזאת שהיא תתנהל בצורתה הטובה המיטבית."
    ]
  ),
  createQuestion(
    "שאלה לקוסטה ומוסא מדוע אין התייחסות במצע למשרד חברה וקהילה?",
    [
      "mossa",
      "costa",
    ],
    [
      "במצע אנחנו התייחסנו לדברים קריטיים שאנחנו רוצים לקדם ותהליכים שאנחנו חושבים לנכון שיש להם סדר עדיפיות. אנחנו לא אומרים שהמשרד לא חשוב, להפך המשרד הוא מאוד חשוב וחיוני אבל בוא נכיר בעובדות זה משרד מותרות. אם תשים סטודנט ותגיד לו אה אין לך משרד חברה וקהילה הוא לא יבוא ויגיד לך טוב אז אני לא לומד במוסד הזה. אבל הוא משרד חשוב והוא עושה עבודה מעולה. העבודה השוטפת שלו היא רק כלפי מעלה הוא משתדרג בכל יום ויום הרכזים מעולים הם עושים עבודה נהדרת ואני חושב שאפשר רק ללמוד מהם והם יהיו הGUIDENCE בעניין הזה ואנחנו נתמוך במה שצריך ואם יש להם פרויקטים אז אנחנו באמת נתמוך עד הסוף ולא נוריד את הרגל מהדוושה מה שצריך נעזור להם.",
      "לא לקחנו את המצע כמשהו שאנחנו צריכים לספר על כל משרד ומשרד ומה הוא עושה ואיך הם מתקדמים הלאה ואיך הם נושמים ומתי הם אוכלים ארוחת צהריים זה לא המטרה. בסופו של דבר אנחנו צריכים להיות ריאליים, אנחנו הרכבנו את המצע הזה מתוך ההבנה שהקדנציה פה היא בסך הכל לשנה, אנחנו לא רצינו להכניס למצע שלנו 1001 דברים שלא נגיע אחרי זה ל95 אחוז מהם בכלל להתחיל לדון בהם. אנחנו העלנו למצע שלנו את הדברים הקריטיים שדורשים התייחסות ואת השינוי נכון להיום. ובין כל המשרדים שזקוקים לתמיכה ולקידום ונושאים של הון אנושי ושל ועדים במיוחד ושל תארים מתקדמים.מתוך כל אלה החשובים ביותר באמת נכון לעכשיו לצערי זה לא משרד חברתי. הוא פועל הוא נותן את המוצר שנדרש לסטודנטים הוא נותן את היחס ואת היכולות האופרטיביות שלו עובדות בצורה סבירה ואני לא רואה לנכון להיכנס ולהתחיל לעשות משהו מחדש במשרד שגם ככה עובד רק כי אני נכנסתי לנשיאות חדשה. אני רואה לנכון לשנות את הדברים שלא פועלים ושלא עובדים ושעליהם צריך לשים את הדגש.",
    ]
  ),
  createQuestion(
    "באיזו צורה תקדמו מדיה פומבית שבה יוכלו ליצור קשר לקראת הבחירות?",
    [
      "linoy",
      "ido",
      "costa",
      "mossa",
    ],
    [
      "אני חושבת קודם כל שאפשר אולי לנסות לעשות איזה צ'אט, להעביר לינק לקבוצת ווטסאפ לשאול שאלות, יהיה אפשר לפרסם את זה למי שירצה וכמובן השיחות והלעבור בוועדים שכל דורש יוכל לבוא.",
      "אני חושב שעצם השאלה זה איזושהי נורמה שהאגודה לכודה בתוכה גם כיום, כיום כשמגיעים למשרדים וגם אם הרכז נמצא במשרד אומרים מה הבעיה תשלח לו מייל, למה לא לבוא לדבר בלייב. אנחנו נפרסם תאריך שבו נשב ואיפה וכולם מוזמנים להגיע. דבר שני אנחנו ניצור תיבת מייל, כל מי שלא יוכל לבוא ולהיפגש בגלל נגישות, מוזמן לשלוח כל שאלה, התלבטות לתיבה הזו, אני אתן דוגמה, רק היום בבוקר היינו ביחד, התקשר אליי מישהו מפקולטה לרפואה שאמר שקרא את המצע שלנו והתרגש, רצה לדבר איתי ולקבוע פגישה, נתתי לו את המספר טלפון שלי, הסברתי לו שאנחנו לא בתפקיד אבל אם נבחר בשבוע הראשון אני אפגש איתך וזה משהו מאוד חשוב, הנגישות הזאת לסטודנטים. בסוף אנחנו עובדים באגודה ובקמפוס כל מי שנתקל בנו יותר ממוזמן לבוא ולהתייעץ ולשאול.",
      "נפתח קבוצות פייסבוק, ווטסאפ, מיילים אישיים וחוץ מזה אנחנו שנינו מנהלים משרדים אנחנו רוב הזמן שם אנחנו נפתח את הדלתות ונזמין את כל אחד שמעוניין לשבת איתנו להתעניין, חוץ מזה אנחנו עורכים סיורים היקפיים בכלל הפקולטות ולהיפגש עם נציגים וסטודנטים, קודם כל לא בשביל שאנחנו נספר לעצמינו מי אנחנו ומה אנחנו, קודם כל לשמוע מה הבעיות שלהם במה נדרש הטיפול, אין פה שום אספקט של חד כיווניות מבחינתנו, לא רק אנחנו אלה שצריכים אותנו לשאול שאלות אנחנו גם צריכים לשאול את הסטודנטים מה אתם צריכים ולמה אתם נזקקים ובכל הפלטפורמות הקיימות שאנחנו משתמשים היום אנחנו נמשיך לעשות את זה, בפייסבוק, אין צורך באינסטגרם זה לא כזה יעיל, ווטסאפ, מיילים, טלפונים אישיים.",
      "אנחנו אולי מבינים די הרבה במשרדים אבל אנחנו שמנו דגש על ללכת לועדים ולשאול מה מציק להם, מה הם חושבים לא מהם חושבים הם מרגישים את זה, מה הם מרגישים שהם צריכים לשפר אם זה מבחינה פקולטית אם זה מבחינה אגודתית ויצאנו עם תשובות די מספקות ואנחנו נעשה הכול בשביל לשפר את זה ובמידה וניבחר ובמידה ולא אנחנו פשוט נשאיר את התביעה הזאת בתקווה שמי שיבחר יעשה טוב.",
    ]
  ),
  createQuestion(
    "התייחסויות אחרונות:",
    [
      "mossa",
      "costa",
      "linoy",
      "ido",
    ],
    [
      " תודה לכל מי שנשאר עד הסוף, באמת מעריכים, אם למישהו יש ספקות שלא.. חששות כלשהן, משהו שהוא שמע שהוא לא מבין מה זה ובגלל זה הוא מורתע אז בכיף, כמו שאמרנו אתם יכולים לפנות אלינו, נשמח מאוד לשבת אתכם להסביר לכם על הכול, גם להצביע על טעויות שעשינו ואיך התמודדנו איתן וגם על דברים מעולים שעשינו ונמשיך לשרת אתכם עד הסוף.",
      "אסיים בזה שאגיד פעלנו כל התקופה הזאת למען הסטודנטים וכל מה שקידמנו זה היה בשבילם ולקידום האגודה והחוויה הטובה שיש פה, אנחנו נשמח אם תתנו לנו את האפשרות לשנות ולהמשיך להשפיע ולקדם את האינטרסים הסטודנטייאלים ואנחנו מבטיחים לעשות כל מה שביכולתנו בשביל לעשות זאת ואם באמת יש שאלות נוספות שאתם רוצים שאנחנו נעביר לכם ונספר על דברים שחסרים, אנחנו במשרדים וכמעט חיים שם אז אתם יודעים איפה למצוא אותנו ונשמח לדבר אתכם גם בטלפון והדלתות שלנו תמיד יהיו פתוחות גם אם ניכנס לנשיאות וזו הפרקטיקה שנשאף ליישם בפועל.",
      "אני רוצה לגעת בשני דברים שלא עלו וחשוב לי לנצל את הפורום הזה בשביל להגיד את זה- מועצת נציגים וועדים, מי שהיה במועצת הנציגים האחרונה מבין שאנחנו נמצאים במצב בעייתי, בסוף מדובר בסוג של מערך המתנדבים שיש לנו באגודה, החוליה המקשרת הכי בסיסית ואלמנטרית לסטודנטים, זה משהו שאני מופתעת שלא שאלו, בעצם להתעסק במועצות נציגים שהן מכבדות, ענייניות ומייצגות אותנו כאגודה, בסוף זה המופע הדמוקרטי שאנחנו נתקלים בו פעם בסמסטר והדבר הבא זה עניין הועדים, בתור מישהי שבאה מועד זה להתעסק ולהנחיל איזשהו סטייט אוף מיינד כזה של איך אנחנו תופסים ועדים ואת השירות לועדים, גם כאנשים להיוועץ בהם וגם כאנשים לנסות לעזור ולהרים את הפעילות שלהם.",
      "חשוב לי גם להבהיר לכולם שכחלק מההיערכות שלנו להתמודדות יצא לנו לדבר עם כל מנהלי המשרדים, עם כל יורי הועדים, כמובן עם הנשיאות הזאת וגם עם קודמות בנוסף אני ממש רוצה להגיד לכם תודה שאתם יושבים פה ושמעתם ואלה שישבו עד הסוף אז באמת תודה רבה, אלה שצופים בלייב. דבר נוסף אני רוצה להזמין את כולכם להיכנס ולקרוא את המצע שלנו הוא ממש מבחינתנו לוקחים אותו ברצינות והוא ממש חוזה חתום תרתי משמע. ",
    ]
  )
]
const candidates =
{
  "costa": "קוסטה",
  "linoy": "לינוי",
  "ido": "עידו",
  "mossa":"מוסא"
}
class Debate extends React.Component {
  constructor(props){
    super(props);
    this.state = {
      expanded_video:false,
      expanded_presentation: false,
      expanded_text: false,
      expand_audience_text: false,
      expand_questions:Array(questions.length).fill(false),
      expand_questions_audience:Array(audience_questions.length).fill(false)
    }
    var blabla = createQuestion("blablabla", ["speak1", "speak2"], ["text1", "text2"]);
    console.log(blabla, "blabla");

    this.setExpandVideo = this.setExpandVideo.bind(this)
    this.handleExpandClickVideo = this.handleExpandClickVideo.bind(this)

    this.setExpandPresentation = this.setExpandPresentation.bind(this)
    this.handleExpandClickPresentation = this.handleExpandClickPresentation.bind(this)

    this.setExpandText = this.setExpandText.bind(this)
    this.handleExpandClickText = this.handleExpandClickText.bind(this)

  }

  setExpandVideo(value){
    this.setState({expanded_video:value});
  }

  handleExpandClickVideo = () =>
  {
    this.setExpandVideo(!this.state.expanded_video);
  }

  setExpandPresentation(value){
    this.setState({expanded_presentation:value});
  }

  handleExpandClickPresentation = () =>
  {
    this.setExpandPresentation(!this.state.expanded_presentation);
  }

  setExpandText(value){
    this.setState({expanded_text:value});
  }

  handleExpandClickText = () =>
  {
    this.setExpandText(!this.state.expanded_text);
  }
  setExpandTextAudience(value){
    this.setState({expand_audience_text:value});
  }

  handleExpandClickTextAudience = () =>
  {
    this.setExpandTextAudience(!this.state.expand_audience_text);
  }

  setExpandQuestion(value, index){
    var tmp_questions = this.state.expand_questions;
    tmp_questions[index]=value;
    console.log(tmp_questions, "tmp_questions");
    this.setState({expand_questions: tmp_questions});
  }

  handleExpandClickQuestion = (index) =>
  {
    this.setExpandQuestion(!this.state.expand_questions[index], index);
  }

  setExpandQuestionAudience(value, index){
    var tmp_questions = this.state.expand_questions_audience;
    tmp_questions[index]=value;
    this.setState({expand_questions_audience: tmp_questions});
  }

  handleExpandClickQuestionAudience = (index) =>
  {
    this.setExpandQuestionAudience(!this.state.expand_questions_audience[index], index);
  }


  _onReady(event) {
    // access to player in all event handlers via event.target
    event.target.pauseVideo();
  }
  render(){
    var images =
    {
      "mossa": require("../images/moussa.png"),
      "linoy": require("../images/linoy_b.png"),
      "ido": require("../images/ido.png"),
      "costa": require("../images/costa.png"),
    };

    const classes = this.props.classes;
    const opts = {
      height: '390',
      width: '640',
      playerVars: { // https://developers.google.com/youtube/player_parameters
        autoplay: 1
      }
    };
    return (
      <div dir="rtl">
        <Card className={classes.card}>
          <CardHeader
            classes={{
              title: classes.title,
            }}
            title={"צפו בעימות הבחירות או קראו את תמלול העימות עליו בוססו חלקים ניכרים מאתר זה!" }
          />
          <CardContent>
            <div style={{textAlign:"center"}}>
              <Typography className={classes.textField} style={{display:"inline"}}>
                <Box fontWeight="fontWeightBold" textAlign="center" fontSize="30" className={classes.boxQuestion} style={{display:"inline"}}>
                   לצפייה בוידאו העימות
                </Box>
              </Typography>

              <IconButton
              className={clsx(classes.expand, {
                [classes.expandOpen]: this.state.expanded_video,
              })}
              onClick={this.handleExpandClickVideo}
              aria-expanded={this.state.expanded_video}
              aria-label="show more"
              >
                <ExpandMoreIcon />
              </IconButton>
            </div>

            <Collapse in={this.state.expanded_video} timeout="auto" unmountOnExit>
              <Typography className={classes.textField}>
                <Box fontWeight="fontWeightBold" textAlign="right" fontSize="30" className={classes.boxQuestion}>
                   תודה רבה לאליאס בשאראת על צילום ועריכה של העימות באיכות נהדרת.
                </Box>
              </Typography>
              <div className={classes.image}>
                <YouTube
                videoId="yHVjcN4cQjw"
                opts={opts}
                onReady={this._onReady}
                />
              </div>
            </Collapse>
          </CardContent>
          <CardContent>
          <div style={{textAlign:"center"}}>
            <Typography className={classes.textField} style={{display:"inline"}}>
              <Box fontWeight="fontWeightBold" textAlign="center" fontSize="30" className={classes.boxQuestion} style={{display:"inline"}}>
                 לצפייה בתמלול הצגות המועמדים:
              </Box>
            </Typography>

            <IconButton
            className={clsx(classes.expand, {
              [classes.expandOpen]: this.state.expanded_presentation,
            })}
            onClick={this.handleExpandClickPresentation}
            aria-expanded={this.state.expanded_presentation}
            aria-label="show more"
            >
              <ExpandMoreIcon />
            </IconButton>
          </div>
          <Collapse in={this.state.expanded_presentation} timeout="auto" unmountOnExit>
            <div style={{textAlign:"right"}}>
              <Box textAlign="right" className={classes.boxChapter}>
                  הצגת מועמדים:
              </Box>

              <Box fontWeight="fontWeightBold" textAlign="right" className={classes.boxQuestion} style={{display:"inline"}}>
                <img
                  id="mosa-image"
                  className="d-inline-block align-top mr-1"
                  style={{ maxWidth: "30px" }}
                  src={images["linoy"]}
                  alt="mosa"
                />

                  לינוי:
              </Box>
            אני יושבת ראש של ועד חומרים, חברה בסגל סטודנטים, ועד מנהל וועדת הכספים. לפני כן הייתי פרויקטורית אח בוגר ולפני כן מנהלת המק"מ ולפני כן רכזת מילואים. בצבא הייתי קצינת לוגיסטיקה. ניהול די אלטרנטיבי ושונה. אני בעלת זיקה אקדמית, ניסיון חמש שנים בניהול, איזושהי הבנה של מצב כלכלי, שיח בין אישי ברמה גבוהה
            <br/>
            <br/>
            <Box fontWeight="fontWeightBold" textAlign="right" className={classes.boxQuestion} style={{display:"inline"}}>
                <img
                  id="mosa-image"
                  className="d-inline-block align-top mr-1"
                  style={{ maxWidth: "30px" }}
                  src={images["ido"]}
                  alt="mosa"
                />

                עידו:
            </Box>
            קצין לוחם. כיום סיור ועדה אקדמית, לפני זה יו"ר ועדת בחירות לנציגי סמסטר ובחירות לנשיאות, ממלא מקום חבר ועדת ביקורת. מגוון התפקידים עוזרים ביתרון להבנה כוללת של האגודה ושל ההתנהלויות השוטפות. השגתי את אחוז המצביעים הכי גבוה בבחירות לנציגים. יוזם דברים שהם מעבר, תהליכים שהם בשגרה, יצירת קבצים. אחראי חונכים במכינה, מנהל 30 חונכים. יש בינינו היכרות לא מעמיקה.
            <br/>
            <br/>
            <Box fontWeight="fontWeightBold" textAlign="right" className={classes.boxQuestion} style={{display:"inline"}}>
              <img
                id="mosa-image"
                className="d-inline-block align-top mr-1"
                style={{ maxWidth: "30px" }}
                src={images["mossa"]}
                alt="mosa"
              />

                מוסא:
            </Box>
            סמסטר 9 כי עברתי מסלול לא כי אני כושל. מצטיין פעמיים פעם נשיא פעם דיקן. רכז רשויות, מנהל במה משנית היה מוצלח מאוד. כמנהל משרד תרבות עבדתי מאוד קשה להציב את המשרד איפה שהוא היום התחייבתי להרים את התוכן של המשרד לסטודנטים, הרצאות עם תוכן, גיוונו את התכנים. תבואו למסיבות יהיה כיף, לוקחים הכול באיזי.
            <br/>
            <br/>
            <Box fontWeight="fontWeightBold" textAlign="right" className={classes.boxQuestion} style={{display:"inline"}}>
              <img
                id="mosa-image"
                className="d-inline-block align-top mr-1"
                style={{ maxWidth: "30px" }}
                src={images["costa"]}
                alt="mosa"
              />

                קוסטה:
            </Box>
            רכז מכונות מנהל משרד קמפוס. הרמנו מ- 0 את הרמה המקצועית במשרד בעזרת הרכבה של זיכרון ארגוני ונהלי עבודה ברורים, גייסתי הון אנושי. פיתוח חניות בלב הקמפוס, ייצוג האגודה בבית משפט, סיורים במעונות, שיפוץ המון דברים, הפקנו סרטוני וידאו, הוצאנו גורמים לא רצויים מהאגודה
            <br/>
            <br/>
          </div>
            </Collapse>
          </CardContent>

          <CardContent>
          <div style={{textAlign:"center"}}>
            <Typography className={classes.textField} style={{display:"inline"}}>
              <Box fontWeight="fontWeightBold" textAlign="center" fontSize="30" className={classes.boxQuestion} style={{display:"inline"}}>
                 לצפייה בתמלול שאלות הועדה ותשובות אליהן:
              </Box>
            </Typography>

            <IconButton
            className={clsx(classes.expand, {
              [classes.expandOpen]: this.state.expanded_text,
            })}
            onClick={this.handleExpandClickText}
            aria-expanded={this.state.expanded_text}
            aria-label="show more"
            >
              <ExpandMoreIcon />
            </IconButton>
            </div>
            <Collapse in={this.state.expanded_text} timeout="auto" unmountOnExit>
              <div style={{textAlign:"right"}}>
                {questions.map(  (question, idx) =>
                  {
                    return(
                      <div>
                        <div style={{textAlign:"center"}}>
                          <Typography className={classes.textField} style={{display:"inline"}}>
                            <Box textAlign="center" fontSize="20" className={classes.boxQuestionCandidate} style={{display:"inline"}}>
                               {question.q}
                            </Box>
                          </Typography>

                          <IconButton
                          className={clsx(classes.expand, {
                            [classes.expandOpen]: this.state.expand_questions[idx],
                          })}
                          onClick={() => this.handleExpandClickQuestion(idx)}
                          aria-expanded={this.state.expanded_text}
                          aria-label="show more"
                          >
                            <ExpandMoreIcon />
                          </IconButton>
                          </div>
                          <Collapse in={this.state.expand_questions[idx]} timeout="auto" unmountOnExit>
                            <div style={{textAlign:"right"}}>
                              {question.answers.map( answer =>
                                {
                                  return(
                                    <div>
                                      <Box fontWeight="fontWeightBold" textAlign="right" className={classes.boxQuestion} style={{display:"inline"}}>
                                        <img
                                          id="mosa-image"
                                          className="d-inline-block align-top mr-1"
                                          style={{ maxWidth: "30px" }}
                                          src={images[answer.speaker]}
                                          alt="mosa"
                                        />

                                         {candidates[answer.speaker] + ": "}
                                      </Box>
                                      {answer.text}
                                      <br/>
                                      <br/>
                                    </div>
                                  )
                                }

                              )}
                            </div>
                          </Collapse>
                      </div>
                    )
                  }

                )}
              </div>
            </Collapse>
          </CardContent>

                    <CardContent>
                    <div style={{textAlign:"center"}}>
                      <Typography className={classes.textField} style={{display:"inline"}}>
                        <Box fontWeight="fontWeightBold" textAlign="center" fontSize="30" className={classes.boxQuestion} style={{display:"inline"}}>
                           לצפייה בתמלול שאלות הקהל ותשובות אליהן:
                        </Box>
                      </Typography>

                      <IconButton
                      className={clsx(classes.expand, {
                        [classes.expandOpen]: this.state.expanded_text,
                      })}
                      onClick={this.handleExpandClickTextAudience}
                      aria-expanded={this.state.expand_audience_text}
                      aria-label="show more"
                      >
                        <ExpandMoreIcon />
                      </IconButton>
                      </div>
                      <Collapse in={this.state.expand_audience_text} timeout="auto" unmountOnExit>
                        <div style={{textAlign:"right"}}>
                          {audience_questions.map(  (question, idx) =>
                            {
                              return(
                                <div>
                                  <div style={{textAlign:"center"}}>
                                    <Typography className={classes.textField} style={{display:"inline"}}>
                                      <Box textAlign="center" fontSize="20" className={classes.boxQuestionCandidate} style={{display:"inline"}}>
                                         {question.q}
                                      </Box>
                                    </Typography>

                                    <IconButton
                                    className={clsx(classes.expand, {
                                      [classes.expandOpen]: this.state.expand_questions_audience[idx],
                                    })}
                                    onClick={() => this.handleExpandClickQuestionAudience(idx)}
                                    aria-expanded={this.state.expand_audience_text}
                                    aria-label="show more"
                                    >
                                      <ExpandMoreIcon />
                                    </IconButton>
                                    </div>
                                    <Collapse in={this.state.expand_questions_audience[idx]} timeout="auto" unmountOnExit>
                                      <div style={{textAlign:"right"}}>
                                        {question.answers.map( answer =>
                                          {
                                            return(
                                              <div>
                                                <Box fontWeight="fontWeightBold" textAlign="right" className={classes.boxQuestion} style={{display:"inline"}}>
                                                    <img
                                                      id="mosa-image"
                                                      className="d-inline-block align-top mr-1"
                                                      style={{ maxWidth: "30px" }}
                                                      src={images[answer.speaker]}
                                                      alt="mosa"
                                                    />

                                                   {candidates[answer.speaker] + ": "}
                                                </Box>
                                                {answer.text}
                                                <br/>
                                                <br/>
                                              </div>
                                            )
                                          }

                                        )}
                                      </div>
                                    </Collapse>
                                </div>
                              )
                            }

                          )}
                        </div>
                      </Collapse>
                    </CardContent>
        </Card>
      </div>
    );
  }
}

Debate.propTypes = {
  classes:PropTypes.object.isRequired,
};


export default withStyles(styles)(Debate);
